mabs239/STM32F4/STM32F4-Discovery_FW_V1.1.0/Project/One Node/One_Node/VCP_F4DISCO_Keil_release_2/VCP/RF_Com/mrfi_radio.c
#define MRFI_CONFIG_GDO2_AS_PAPD_SIGNAL()           mrfiSpiWriteReg(IOCFG2, MRFI_GDO_PA_PD)
#define MRFI_CONFIG_GDO2_AS_SYNC_SIGNAL()           mrfiSpiWriteReg(IOCFG2, MRFI_GDO2_SYNC)


/* There is no bit in h/w to tell if RSSI in the register is valid or not.
 * The hardware needs to be in RX state for a certain amount of time before
 * a valid RSSI value is calculated and placed in the register. This min
 * wait time is defined by MRFI_BOARD_RSSI_VALID_DELAY_US. We don't need to
 * add such delay every time RSSI value is needed. If the Carier Sense signal
 * is high or CCA signal is high, we know that the RSSI value must be valid.
 * We use that knowledge to reduce our wait time. We break down the delay loop
 * in multiple chunks and during each iteration, check for the CS and CCA
 * signal. If either of these signals is high, we return immediately. Else,
 * we wait for the max delay specified.
 */
#define MRFI_RSSI_VALID_WAIT()                                                \
{                                                                             \
  int16 delay = MRFI_RSSI_VALID_DELAY_US;                                   \
  do                                                                          \
  {                                                                           \
    if(mrfiSpiReadReg(PKTSTATUS) & (MRFI_PKTSTATUS_CCA | MRFI_PKTSTATUS_CS))  \
    {                                                                         \
      break;                                                                  \
    }                                                                         \
    Mrfi_DelayUsec(64); /* sleep */                                           \
    delay -= 64;                                                              \
  }while(delay > 0);                                                          \
}                                                                             \

#define MRFI_STROBE_IDLE_AND_WAIT()                   \
{                                                     \
  mrfiSpiCmdStrobe( SIDLE );                          \
  while (mrfiSpiCmdStrobe( SNOP ) & 0xF0) ;           \
}


//extern unsigned char USB_Packet_Time[23]; // added by MT
extern char rx_flag;
/* ------------------------------------------------------------------------------------------------
 *                                    Local Constants
 * ------------------------------------------------------------------------------------------------
 */
static const uint8 mrfiRadioCfg[][2] =
{
  /* internal radio configuration */
  {  IOCFG0,    MRFI_SETTING_IOCFG0       },
  {  IOCFG2,    MRFI_SETTING_IOCFG2       },
  {  MCSM1,     MRFI_SETTING_MCSM1        },
  {  MCSM0,     MRFI_SETTING_MCSM0        },
  {  PKTLEN,    MRFI_SETTING_PKTLEN       },
  {  PKTCTRL0,  MRFI_SETTING_PKTCTRL0     },
  {  PATABLE,   MRFI_SETTING_PATABLE0     },
#ifdef MRFI_CC1101
  {  FIFOTHR,   MRFI_SETTING_FIFOTHR      },
#endif

  /* imported SmartRF radio configuration */
  {  FSCTRL1,   SMARTRF_SETTING_FSCTRL1   },
  {  FSCTRL0,   SMARTRF_SETTING_FSCTRL0   },
  {  PKTCTRL1,  SMARTRF_SETTING_PKTCTRL1  },
  {  ADDR, 	SMARTRF_SETTING_ADDR	  },
  {  FREQ2,     SMARTRF_SETTING_FREQ2     },
  {  FREQ1,     SMARTRF_SETTING_FREQ1     },
  {  FREQ0,     SMARTRF_SETTING_FREQ0     },
  {  MDMCFG4,   SMARTRF_SETTING_MDMCFG4   },
  {  MDMCFG3,   SMARTRF_SETTING_MDMCFG3   },
  {  MDMCFG2,   SMARTRF_SETTING_MDMCFG2   },
  {  MDMCFG1,   SMARTRF_SETTING_MDMCFG1   },
  {  MDMCFG0,   SMARTRF_SETTING_MDMCFG0   },
  {  DEVIATN,   SMARTRF_SETTING_DEVIATN   },
  {  FOCCFG,    SMARTRF_SETTING_FOCCFG    },
  {  BSCFG,     SMARTRF_SETTING_BSCFG     },
  {  AGCCTRL2,  SMARTRF_SETTING_AGCCTRL2  },
  {  AGCCTRL1,  SMARTRF_SETTING_AGCCTRL1  },
  {  AGCCTRL0,  SMARTRF_SETTING_AGCCTRL0  },
  {  FREND1,    SMARTRF_SETTING_FREND1    },
  {  FREND0,    SMARTRF_SETTING_FREND0    },
  {  FSCAL3,    SMARTRF_SETTING_FSCAL3    },
  {  FSCAL2,    SMARTRF_SETTING_FSCAL2    },
  {  FSCAL1,    SMARTRF_SETTING_FSCAL1    },
  {  FSCAL0,    SMARTRF_SETTING_FSCAL0    },
  {  TEST2,     SMARTRF_SETTING_TEST2     },
  {  TEST1,     SMARTRF_SETTING_TEST1     },
  {  TEST0,     SMARTRF_SETTING_TEST0     },
};

/* ------------------------------------------------------------------------------------------------
 *                                       Local Prototypes
 * ------------------------------------------------------------------------------------------------
 */

static void Mrfi_SyncPinRxIsr(void);
//static void Mrfi_RxModeOn(void);
static void Mrfi_RandomBackoffDelay(void);
//static void Mrfi_RxModeOff(void);
static void Mrfi_DelayUsec(uint32_t howLong);
static void Mrfi_DelayUsecSem(uint16 howLong);
static int8 Mrfi_CalculateRssi(uint8 rawValue);


/* ------------------------------------------------------------------------------------------------
 *                                       Local Variables
 * ------------------------------------------------------------------------------------------------
 */
static uint8 mrfiRadioState  = MRFI_RADIO_STATE_UNKNOWN;
static mrfiPacket_t mrfiIncomingPacket;
static uint8 mrfiRndSeed;

/* reply delay support */
static volatile uint8  sReplyDelayContext;
static volatile uint8  sKillSem;
static          uint16 sReplyDelayScalar;
static          uint16 sBackoffHelper;

/**************************************************************************************************
 * @fn          MRFI_Init
 *
 * @brief       Initialize MRFI.
 *
 * @param       none
 *
 * @return      none
 **************************************************************************************************
 */
void MRFI_Init(void)
{
  uint8 i;

  /* ------------------------------------------------------------------
   *    Initialization
   *   -----------------
   */
  
  /* initialize GPIO pins */
  MRFI_CONFIG_GDO2_PIN_AS_INPUT();

  /* initialize SPI */
  //mrfiSpiInit();

  /* ------------------------------------------------------------------
   *    Radio power-up reset
   *   ----------------------
   */
 
  /* pulse CSn low then high */
  MRFI_SPI_DRIVE_CSN_LOW();
  Mrfi_DelayUsec(20);
  MRFI_SPI_DRIVE_CSN_HIGH();

