mabs239/STM32F4/STM32F4-Discovery_FW_V1.1.0/Project/One Node/One_Node/VCP_F4DISCO_Keil_release_2/VCP/RF_Com/mrfi_radio.c
/*            
            rxBytes = mrfiIncomingPacket.frame[5];
			
				arr_ptr = USB_Packet_Time;

				if(rxBytes == 0x79){
					USB_Packet_Time[2] = 0x31;
					rx_flag = 1;
				}
				
				else if (rxBytes == 0x7A){
					USB_Packet_Time[2] = 0x32;
					rx_flag = 1;
				}
				
				else if (rxBytes == 0x7B){
					USB_Packet_Time[2] = 0x33;
					rx_flag = 1;
				}

				else if (rxBytes == 0x7C){
					USB_Packet_Time[2] = 0x34;
					rx_flag = 1;
				}
				
				else
					USB_Packet_Time[2] = 'x';

				rxBytes = mrfiIncomingPacket.frame[12];
				*(arr_ptr + 6) =	0x30 + (rxBytes & 0x0F);
				*(arr_ptr + 5) =	0x30 + ((rxBytes >> 4) & 0x03);

				rxBytes = mrfiIncomingPacket.frame[13];
				*(arr_ptr + 9) =	0x30 + (rxBytes & 0x0F);
				*(arr_ptr + 8) =	0x30 + (rxBytes >> 4);

				rxBytes = mrfiIncomingPacket.frame[14];
				*(arr_ptr + 12) =	0x30 + (rxBytes & 0x0F);
				*(arr_ptr + 11) =	0x30 + (rxBytes >> 4);

				rxBytes = mrfiIncomingPacket.frame[15];
				lowdigit = (char)(rxBytes % 10);
				*(arr_ptr + 18) =	0x30 + lowdigit;
				*(arr_ptr + 17) =	0x30 + (rxBytes - lowdigit)/10;

				rxBytes = mrfiIncomingPacket.frame[17];
				lowdigit = (char)(rxBytes % 10);
				*(arr_ptr + 15) =	0x30 + lowdigit;
				*(arr_ptr + 14) =	0x30 + (rxBytes - lowdigit)/10;


            MRFI_RxCompleteISR();
*/
          }
        }
      }
    }
  }

  /* ------------------------------------------------------------------
   *    End of function
   *   -------------------
   */
}

/**************************************************************************************************
 * @fn          Mrfi_RxModeOn
 *
 * @brief       Put radio into receive mode.
 *
 * @param       none
 *
 * @return      none
 **************************************************************************************************
 */
void Mrfi_RxModeOn(void)
{
  /* clear any residual receive interrupt */
  MRFI_CLEAR_SYNC_PIN_INT_FLAG();

  /* send strobe to enter receive mode */
  mrfiSpiCmdStrobe( SRX );

  /* enable receive interrupts */
  MRFI_ENABLE_SYNC_PIN_INT();
}

/**************************************************************************************************
 * @fn          MRFI_RxOn
 *
 * @brief       Turn on the receiver.  No harm is done if this function is called when
 *              receiver is already on.
 *
 * @param       none
 *
 * @return      none
 **************************************************************************************************
 */
void MRFI_RxOn(void)
{
  /* radio must be awake before we can move it to RX state */
  if( mrfiRadioState == MRFI_RADIO_STATE_OFF )
		return;

  /* if radio is off, turn it on */
  if(mrfiRadioState != MRFI_RADIO_STATE_RX)
  {
    mrfiRadioState = MRFI_RADIO_STATE_RX;
    Mrfi_RxModeOn();
  }
}

/**************************************************************************************************
 * @fn          Mrfi_RxModeOff
 *
 * @brief       -
 *
 * @param       none
 *
 * @return      none
 **************************************************************************************************
 */
void Mrfi_RxModeOff(void)
{
  /*disable receive interrupts */
  MRFI_DISABLE_SYNC_PIN_INT();

  /* turn off radio */
  MRFI_STROBE_IDLE_AND_WAIT();

  /* flush the receive FIFO of any residual data */
  mrfiSpiCmdStrobe( SFRX );

  /* clear receive interrupt */
  MRFI_CLEAR_SYNC_PIN_INT_FLAG();
}


/**************************************************************************************************
 * @fn          MRFI_RxIdle
 *
 * @brief       Put radio in idle mode (receiver if off).  No harm is done this function is
 *              called when radio is already idle.
 *
 * @param       none
 *
 * @return      none
 **************************************************************************************************
 */
void MRFI_RxIdle(void)
{
  /* radio must be awake to move it to idle mode */
  if( mrfiRadioState != MRFI_RADIO_STATE_OFF )  
	  return; 

  /* if radio is on, turn it off */
  if(mrfiRadioState == MRFI_RADIO_STATE_RX)
  {
    Mrfi_RxModeOff();
    mrfiRadioState = MRFI_RADIO_STATE_IDLE;
  }
}


/**************************************************************************************************
 * @fn          MRFI_Sleep
 *
 * @brief       Request radio go to sleep.
 *
 * @param       none
 *
 * @return      none
 **************************************************************************************************
 */
void MRFI_Sleep(void)
{
  mrfiSpiIState_t s;

  /* Critical section necessary for watertight testing and
   * setting of state variables.
   */
  //MCU_ENTER_CRITICAL_SECTION(s);

  /* If radio is not asleep, put it to sleep */
  if(mrfiRadioState != MRFI_RADIO_STATE_OFF)
  {
    /* go to idle so radio is in a known state before sleeping */
    MRFI_RxIdle();

    mrfiSpiCmdStrobe( SPWD );

    /* Our new state is OFF */
    mrfiRadioState = MRFI_RADIO_STATE_OFF;
  }

  //MCU_EXIT_CRITICAL_SECTION(s);
}


/**************************************************************************************************
 * @fn          MRFI_WakeUp
 *
 * @brief       Wake up radio from sleep state.
 *
 * @param       none
 *
 * @return      none
 **************************************************************************************************
 */
void MRFI_WakeUp(void)
{
  /* if radio is already awake, just ignore wakeup request */
  if(mrfiRadioState != MRFI_RADIO_STATE_OFF)
  {
    return;
  }

  /* drive CSn low to initiate wakeup */
  MRFI_SPI_DRIVE_CSN_LOW();

  /* wait for MISO to go high indicating the oscillator is stable */
  while (MRFI_SPI_SO_IS_HIGH());

  /* wakeup is complete, drive CSn high and continue */
  MRFI_SPI_DRIVE_CSN_HIGH();

/*
 *  The test registers must be restored after sleep for the CC1100 and CC2500 radios.
 *  This is not required for the CC1101 radio.
 */
#ifndef MRFI_CC1101
  mrfiSpiWriteReg( TEST2, SMARTRF_SETTING_TEST2 );
  mrfiSpiWriteReg( TEST1, SMARTRF_SETTING_TEST1 );
  mrfiSpiWriteReg( TEST0, SMARTRF_SETTING_TEST0 );
#endif

  /* enter idle mode */
  mrfiRadioState = MRFI_RADIO_STATE_IDLE;
  MRFI_STROBE_IDLE_AND_WAIT();
}


